Revit 2027 API
Railing.GetMultistoryStairsPlacementLevels Method
 Gets the ids of the base levels of the stairs upon which this railing is placed.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetMultistoryStairsPlacementLevels()
Public Function GetMultistoryStairsPlacementLevels As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetMultistoryStairsPlacementLevels()
member GetMultistoryStairsPlacementLevels : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The ids of levels the railing is placed on. The returned set consists of a subset of the base level ids of the corresponding stairs in the MultistoryStairs.
Exceptions
Exception | Condition
InvalidOperationException |  The railing is not hosted by stairs in MultistoryStairs.
Remarks
 The method is valid only for railings hosted by stairs in MultistoryStairs.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace